<?php

/* * ********************************************************************************************************************************
 *   深圳市宇初网络技术有限公司 PHP 客户插件配置文件
 *   日期：2012-7-11
 *   配置版本：1.0.0
 *   核心版本：1.0.0
 * ******************************************************************************************************************************* */
return array(
    //站点编码
    'YUC_RESPONSE_CHARSET' => 'UTF-8',
    //缓存默认周期
    'YUC_CACHE_EXPIRE' => 10,
    //定义日志输出的周期
    'YUC_LOG_TYPE' => 'EMERG',
    //定义日志的大小
    'YUC_LOG_SIZE' => 1024 * 1024,
    //站点的安全Key配置
    'YUC_SITE_KEY' => '',
    //站点通信密钥
    'YUC_SECURE_KEY' => '',
    //永久本地化
    'YUC_CODE_IS_LOCAL' => FALSE,
    //配置本地服务器地址 为空时自动获取
    'YUC_LOCAL_SERVER' => '',
    //配置本地服务器端口 为空时自动获取
    'YUC_LOCAL_PORT' => '',
    //验证码 加密密钥
    'YUC_ENCRYPT_KEY' => '',
);




